// http://139.224.52.12:8088/jymj-zjw/ylhuji/saveHuji
// User:bygc
// PWD:bygc

;
var JJ_AUTO_TASK_2_index = 0;

function JJ_AUTO_TASK_2(num) {
    // var data = `与户主关系_,姓名_,公民身份号码_,性别_,出生日期_,住址_,,,,,,`
    var data = `与户主关系_,姓名_,公民身份号码_,性别_,住址_,住址详址_
    户主(男)_,程宝全_,110223198411223530_,男_,张家湾镇北仪阁村001号_,
    户主(女)_,赵凡_,11022319921207352X_,女_,张家湾镇北仪阁村002号_, 
    户主(男)_,张继武_,11022319771024357X_,男_,张家湾镇北仪阁村003号_,
    之女,张灵煜,110112201004193549,女_,张家湾镇北仪阁村003号_,
    户主(男)_,李岩_,110223199302243510_,男_,张家湾镇北仪阁村004号_,
    户主(女)_,王丹丹_,110223199211303522_,女_,张家湾镇北仪阁村011号_,
    户主(女)_,王培_,110223198601033527_,女_,张家湾镇北仪阁村013号_,
    户主(男)_,李德峰_,11022319860527351X_,男_,张家湾镇北仪阁村014号_,
    之子, 李逸晨,110112201302153510,男_,张家湾镇北仪阁村014号_,
    户主（男）,王子康_,110223199607223510_,男_,张家湾镇北仪阁村015号_,
    户主(女)_,王海侠_,110223199105173541_,女_,张家湾镇北仪阁村018号_,
    户主（男）,张立军,110223197201013557,男_,张家湾镇北仪阁村022号_,
    户主(男)_,张继兴_,110223199104063535_,男_,张家湾镇北仪阁村024号_,
    户主(女)_,王莉娜,110223199101303521_,女_,张家湾镇北仪阁村032号_,
    户主(男)_,张亮_,110223196501223519_,男_,张家湾镇北仪阁村037号_,
    妻_,杨秀敏,110223196505273548_,女_,张家湾镇北仪阁037号村_,
    户主(男)_,张洋洋_,110223198712046451_,男_,张家湾镇北仪阁村037号_,
    户主(女)_,张宝丹_,110223198502103526_,女_,张家湾镇北仪阁村038号_,
    女儿, 刘昕_,110112201303193522,女_,张家湾镇北仪阁村038号_,
    户主(男)_,张建军_,110223198908013512_,男_,张家湾镇北仪阁村038号_,
    户主(男)_,张立剑_,110223198912153518_,男_,张家湾镇北仪阁村039号_,
    户主（女）,张凌云,11022319800616352X,女_,张家湾镇北仪阁村044号_,
    户主(女)_,刘新蕊_,11022319870622352X_,女_,张家湾镇北仪阁村045号_,
    户主(男)_,刘畅_,110223198911163511_,男_,张家湾镇北仪阁村046号_,
    户主(男)_,刘玉长_,11022319660605351X_,男_,张家湾镇北仪阁村046号_,
    户主(男)_,刘洪福_,110223198512263531_,男_,张家湾镇北仪阁村047号_,
    户主(男)_,刘洪宝_,110223199009303537,男_,张家湾镇北仪阁村049号_,
    户主(男)_,刘玉磊_,110223198607153538_,男_,张家湾镇北仪阁村052号_,
    户主(男)_,刘玉庆_,110223197909263535_,男_,张家湾镇北仪阁村052号_,
    之子,刘名轩,110112201203313515,男_,张家湾镇北仪阁村052号_,
    户主(女)_,刘芳_,110223198503103528_,女_,张家湾镇北仪阁村053号_,
    女儿,雷蓝婷,110112201002183523,女_,张家湾镇北仪阁村053号_,
    子_,刘利_,110223199511063516_,男_,张家湾镇北仪阁村056号_,
    户主(女)_,王新阁_,110223198909293528_,女_,张家湾镇北仪阁村058号_,
    户主(女)_,张宁,110223199603213526_,女_,张家湾镇北仪阁村062号_,
    户主(男)_,李德利_,110223198210173530_,男_,张家湾镇北仪阁村063号_,
    户主（男）,王海桥,110223199110293513,男_,张家湾镇北仪阁村065号_,
    户主（男）,王海礁,110223198510053530,男_,张家湾镇北仪阁村065号_,
    妻_,魏如新,110227198504250621,女_,张家湾镇北仪阁村065号_,
    之子,王新源,110112201606230335,男,张家湾镇北仪阁村065号_,
    户主(女)_,王晓伟_,110223198411093529_,女_,张家湾镇北仪阁村067号_,
    户主(男)_,王德宝_,110223195411263512_,男_,张家湾镇北仪阁村068号_,
    户主(男)_,张继昌_,110223193904243510_,男_,张家湾镇北仪阁村070号_,
    户主(男)_,张立民_,110223198405223518_,男_,张家湾镇北仪阁村075号_,
    户主(男)_,王文宝,110223195405271073,男_,张家湾镇北仪阁村078号_,
    户主(男)_,王奇_,11022319881125351X_,男_,张家湾镇北仪阁村081号_,
    户主(男)_,王岩_,110223199101013516_,男_,张家湾镇北仪阁村081号_,
    户主(男)_,刘洪柏_,110223198901303533_,男_,张家湾镇北仪阁村083号_,
    户主(男)_,刘洪松_,110223199001143516_,男_,张家湾镇北仪阁村084号_,
    之子,刘子郡,110112201310113519,男,张家湾镇北仪阁村084号_,
    户主(女)_,刘孟男_,110223198605133525_,女_,张家湾镇北仪阁村085号_,
    户主（男）,刘俊德,110223195101073510,男,张家湾镇北仪阁村087号_,
    妻_,张秀玲,110223194708083526,女_,张家湾镇北仪阁村087号_,
    户主(男)_,刘俊丰_,110223194210051076_,男_,张家湾镇北仪阁村088号_,
    户主(男)_,刘洪超_,110223198602113510_,男_,张家湾镇北仪阁村090号_,
    户主(女)_,刘月_,110223198712243543_,女_,张家湾镇北仪阁村090号_,
    之子,王梓丞,110112201306203511_,男_,张家湾镇北仪阁村090号_,
    户主(男)_,刘金泉,110223198801293518,男_,张家湾镇北仪阁村093号_,
    之子,刘_希,110112201305083511,男_,张家湾镇北仪阁村093号_,
    户主(男)_,李冬海_,11022319691209351X_,男_,张家湾镇北仪阁村095号_,
    户主(男)_,李志伟_,110223198712253514_,男_,张家湾镇北仪阁村096号_,
    户主(女)_,李雪静_,110223197802273522_,女_,张家湾镇北仪阁村097号_,
    夫,岳学东,370205197701087515_,男,张家湾镇北仪阁村097号_,
    之女,岳思涵,110112200701233521_,女_,张家湾镇北仪阁村097号_,
    户主（男）,张继海,110106198007104212,男,张家湾镇北仪阁村098号_,
    子_,张恩泽,110112201209163511,男,张家湾镇北仪阁村098号_,
    户主(男)_,张继伟_,11022319861001351X_,男_,张家湾镇北仪阁村099号_,
    户主（男）,王海波,110223198701103510,男_,张家湾镇北仪阁村101号_,
    户主（女),王海月,110223198910143543,女_,张家湾镇北仪阁村101号_,
    户主(男)_,程玉华_,110223195006203516_,男_,张家湾镇北仪阁村104号_,
    户主（女）,张玲玲,110223198601013526,女_,张家湾镇北仪阁村105号_,
    户主（男）,王跃军,110223198010313551,男,张家湾镇北仪阁村110号_,
    户主（女）,王雁,,女_,张家湾镇北仪阁村110号_,
    户主(女)_,刘男_,110223198501173522_,女_,张家湾镇北仪阁村116号_,
    之子,向恩泽,110112201202213512,男_,张家湾镇北仪阁村116号_,
    户主(女)_,赵洪艳_,110223198606203564_,女_,张家湾镇北仪阁村119号_,
    之女,段然,11011220150103352X,女_,张家湾镇北仪阁村119号_,
    户主(男)_,张立伟_,110223198410273536_,男_,张家湾镇北仪阁村040号_,
    女,张宇欣,110112200812203528,女_,张家湾镇北仪阁村040号_,
    户主(女)_,赵乐_,110223199004083547_,女_,张家湾镇北仪阁村122号_,
    户主(女)_,赵鑫,110223198209013548_,女_,张家湾镇北仪阁村122号_,
    户主(男)_,王凯_,110223198611193516_,男_,张家湾镇北仪阁村123号_,
    之女,王靖雅,110112201207293523,女_,张家湾镇北仪阁村123号_,
    户主(女)_,王松岩_,110223198603273540_,女_,张家湾镇北仪阁村124号_,
    之子,刘子俊,110112201403173510,男,张家湾镇北仪阁村124号_,
    户主(男)_,刘祖臻_,110223199009233516_,男_,张家湾镇北仪阁村125号_,
    户主(女)_,程宝燕_,110223198708103548_,女_,张家湾镇北仪阁村126号_,
    户主(女)_,程宝莹_,110223198509273528_,女_,张家湾镇北仪阁村126号_,
    户主(男)_,刘高帅_,110223198804263533_,男_,张家湾镇北仪阁村128号_,
    子_,刘晨曦,110112201701253519,男_,张家湾镇北仪阁村128号_,
    户主(女)_,刘茜,110223199106183522_,女_,张家湾镇北仪阁村131号_,
    之女,贾鎏炀,110112201509253527_,女_,张家湾镇北仪阁村131号_,
    户主(男)_,李凯_,110223198611143535_,男_,张家湾镇北仪阁村132号_,
    户主(男)_,李光,110223198611263537_,男_,张家湾镇北仪阁村134号_,
    之女,李伊诺,110112201702063522,女_,张家湾镇北仪阁村134号_,
    户主(男)_,王乐_,110223199102183517_,男_,张家湾镇北仪阁村136号_,
    户主(女)_,王洪月_,110223198605043589_,女_,张家湾镇北仪阁村145号_,
    户主(男)_,王起_,110223198609043519_,男_,张家湾镇北仪阁村147号_,
    之子,王瑾泽,110112201206223515,男_,张家湾镇北仪阁村147号_,
    户主(女)_,李竹青_,110223198501313521_,女_,张家湾镇北仪阁村149号_,
    之子,蓝皓轩,110112201605263514,男,张家湾镇北仪阁村149号_,
    户主(男)_,刘洪志_,110223198308233538_,男_,张家湾镇北仪阁村150号_,
    户主(男)_,刘玉仁,110223198506103515_,男_,张家湾镇北仪阁村153号_,
    之子,刘祖航,110112201602183519,男_,张家湾镇北仪阁村153号_,
    户主(男)_,刘玉川_,110223198909253550_,男_,张家湾镇北仪阁村153号_,
    户主(女)_,刘彬彬_,110223199005123547_,女_,张家湾镇北仪阁村154号_,
    户主（男）,刘玉健,110223198203273533,男,张家湾镇北仪阁村156号_,
    之女,刘祖怡,110112201302141886,女_,张家湾镇北仪阁村156号_,
    户主(女)_,刘奇_,11022319880919352X_,女_,张家湾镇北仪阁村157号_,
    户主(男)_,刘征_,110223198609213530_,男_,张家湾镇北仪阁村157号_,
    户主（女）,刘玉曼,110223196508313525,女_,张家湾镇北仪阁村160号_,
    户主(女)_,程冬梅_,110223199006233529_,女_,张家湾镇北仪阁村161号_,
    户主(女)_,刘梅_,110223198511013549_,女_,张家湾镇北仪阁村163号_,
    户主(女)_,刘林_,110223198901293523_,女_,张家湾镇北仪阁村163号_,
    之子,曹景然,110112201405193531,男,张家湾镇北仪阁村163号_,
    户主(女)_,王莹_,110223198409213528_,女_,张家湾镇北仪阁村168号_,
    之子,杨潇然,110112201603113512,男,张家湾镇北仪阁村168号_,
    户主(男)_,王跃洲_,110223198704223550_,男_,张家湾镇北仪阁村170号_,
    之女,王佳妮,11011220161117354X,女_,张家湾镇北仪阁村170号_,
    户主(男)_,王跃洋_,110223199403273516_,男_,张家湾镇北仪阁村170号_,
    户主(男)_,王跃垒_,110223198812283550_,男_,张家湾镇北仪阁村171号_,
    之子,王子杰,110112201507253515,男_,张家湾镇北仪阁村171号_,
    户主(男)_,荣玉祥_,110223194903043511_,男_,张家湾镇北仪阁村174号_,
    户主(男)_,王德和_,110223195503263536_,男_,张家湾镇北仪阁村175号_,
    户主(男)_,王跃光_,11022319810113353X_,男_,张家湾镇北仪阁村175号_,
    之女,王佳凝,110112201203023526,女_,张家湾镇北仪阁村175号_,
    户主(女)_,刘影_,110223199001083525_,女_,张家湾镇北仪阁村176号_,
    户主(女)_,徐明明_,110223198502113521_,女_,张家湾镇北仪阁村178号_,
    户主(女)_,徐宝宝_,110223198805013544_,女_,张家湾镇北仪阁村178号_,
    户主(男)_,陈凯_,110223195511023516_,男_,张家湾镇北仪阁村180号_,
    户主(女)_,王海霞,110223197412216960,女_,张家湾镇北仪阁村183号_,
    户主(男)_,刘玉英,110104194501311611_,男_,张家湾镇北仪阁村189号_,
    户主(女)_,荣雪冰_,110223198512243549_,女_,张家湾镇北仪阁村191号_,
    户主(女)_,荣雪金_,110223198709123524_,女_,张家湾镇北仪阁村191号_,
    子_,甘梓涵,110112201401243538,男,张家湾镇北仪阁村191号_,
    女_,刘倩_,110223199005213526_,女_,张家湾镇北仪阁村194号_,
    户主(男)_,王跃强,110223198811083530_,男_,张家湾镇北仪阁村195号_,
    ,安淑清,110223196606165327,女_,张家湾镇北仪阁村195号_,
    户主（女）,王跃苁_,11022319970321354X_,女_,张家湾镇北仪阁村196号_,
    户主男,张凤桐,110112201605113516,男,张家湾镇北仪阁村197号_,
    户主(女)_,王丹_,110223199312133526_,女_,张家湾镇北仪阁村201号_,
    户主(男)_,张昊_,110223198709285574_,男_,张家湾镇北仪阁村202号_,
    之子,张泽霖,,,张家湾镇北仪阁村202号_,
    户主(男)_,张__,110223199209206395_,男_,张家湾镇北仪阁村203号_,
    户主(男)_,李万兴_,110223195512273517_,男_,张家湾镇北仪阁村204号_,
    妻_,张秀荣_,110223195312113527_,女_,张家湾镇北仪阁村204号_,
    户主（女）,张继俊,110223199601113521,女_,张家湾镇北仪阁村206号_,
    户主(男)_,张强_,110223198807196399_,男_,张家湾镇北仪阁村207号_,
    户主(男)_,刘永元_,110223195101176974_,男_,张家湾镇北仪阁村208号_,
    妻_,马素芝_,110223195103153522_,女_,张家湾镇北仪阁村208号_,
    户主（男）,刘春旺_,110223197904023532_,男_,张家湾镇北仪阁村208号_,
    妻_,刘芳_,110111197912025529_,女_,张家湾镇北仪阁村208号_,
    长女,刘婧懿_,110112200309023562_,女_,张家湾镇北仪阁村208号_,
    次女,刘婧洁,110112201109253528,女_,张家湾镇北仪阁村208号_,
    户主(女)_,刘伟_,110223199006293521_,女_,张家湾镇北仪阁村209号_,
    户主(男)_,宗海涛_,110223198309213512_,男_,张家湾镇北仪阁村211号_,
    户主(男)_,王维维_,110223198312133513_,男_,张家湾镇北仪阁村212号_,
    户主(男)_,李德仁_,110223194802273510_,男_,张家湾镇北仪阁村213号_,
    妻_,刘玉荣_,110223194904093529_,女_,张家湾镇北仪阁村213号_,
    长子_,李立民_,110223197509253514_,男_,张家湾镇北仪阁村213号_,
    户主(男)_,张继峰_,110108197801103434_,男_,张家湾镇北仪阁村214号_,
    女_,张芷琦_,110112200501063521_,女_,张家湾镇北仪阁村214号_,
    子_,张屹泽,110112201011253511,男,张家湾镇北仪阁村214号_,
    户主(女)_,张蕊_,11022319921119352X_,女_,张家湾镇北仪阁村215号_,
    户主,王开_,110223199201213515_,男_,张家湾镇北仪阁村218号_,
    之子,王晨熙,110112201505073510,男_,张家湾镇北仪阁村218号_,
    户主（男）,王德仲,110223196007063556,男_,张家湾镇北仪阁村219号_,
    妻_,侯玉娟,110223196211113522,女_,张家湾镇北仪阁村219号_,
    户主(男)_,程东升_,110223198704243551_,男_,张家湾镇北仪阁村220号_,
    户主(男)_,张福军_,110223198412213510_,男_,张家湾镇北仪阁村222号_,
    户主(男)_,刘永庆_,110104194603011636_,男_,张家湾镇北仪阁村224号_,
    户主(女)_,荣秋颖_,110223198904073542_,女_,张家湾镇北仪阁村225号_,
    户主(男)_,荣秋磊_,110223198509303539_,男_,张家湾镇北仪阁村225号_,
    户主(男)_,荣玉宝_,110223195411133531_,男_,张家湾镇北仪阁村228号_,
    户主(女)_,荣雪飞,110223198010263523,女_,张家湾镇北仪阁村228号_,
    之子,张吉林,110112201109073535,男_,张家湾镇北仪阁村228号_,
    女_,刘欢_,110223199202163521_,女_,张家湾镇北仪阁村230号_,
    户主(女)_,王娟_,11022319801122354X_,女_,张家湾镇北仪阁村232号_,
    户主(女)_,王然_,11022319860117352X_,女_,张家湾镇北仪阁村234号_,
    户主（女）,王巍,110223198701143520口,女_,张家湾镇北仪阁村234号_,
    户主（女）,李丽娟_,110223199301103524_,女_,张家湾镇北仪阁村235号_,
    户主（男）,刘玉强,110223197204213511,男_,张家湾镇北仪阁村238号_,
    妻_,齐曦,110105197211215226,女_,张家湾镇北仪阁村238号_,
    之女,刘艾,110112199910010329,女_,张家湾镇北仪阁村238号_,
    户主(男)_,王洪洲_,110223198802203537_,男_,张家湾镇北仪阁村241号_,
    户主(男)_,程玉和_,110104195011151613_,男_,张家湾镇北仪阁村242号_,
    户主(男)_,刘洪涛_,110223198604083511_,男_,张家湾镇北仪阁村245号_,
    之子,刘宇泽,110112201605133517,男_,张家湾镇北仪阁村245号_,
    户主(男)_,刘秀东,110223197512043518,男_,张家湾镇北仪阁村246号_,
    户主(女)_,程宝芳_,110223198612113549_,女_,张家湾镇北仪阁村249号_,
    户主(男)_,刘长生_,110223195706113511_,男_,张家湾镇北仪阁村251号_,
    户主(男)_,刘杨_,110223198611033512_,男_,张家湾镇北仪阁村252号_,
    户主(男)_,王超_,11022319900506353X_,男_,张家湾镇北仪阁村253号_,
    户主(男)_,李敬_,110223198510243510_,男_,张家湾镇北仪阁村254号_,
    之女,李若彤,110112201311283528,女_,张家湾镇北仪阁村254号_,
    户主(男)_,李全斌_,110223194405073515_,男_,张家湾镇北仪阁村257号_,
    户主(女)_,刘莎莎_,110223198602093548_,女_,张家湾镇北仪阁村258号_,
    户主(男)_,刘硕,11022319890718351X_,男_,张家湾镇北仪阁村258号_,
    户主(男)_,李德跃,110223198805283552_,男_,张家湾镇北仪阁村259号_,
    户主(男)_,王文生_,130203193905142111_,男_,张家湾镇北仪阁村261号甲_,
    户主(女)_,刘新_,110223198709173548_,女_,张家湾镇北仪阁村261_,
    二女_,刘羽_,110223199012133540_,女_,张家湾镇北仪阁村261号_,
    户主(男)_,李德生_,110223198801173516_,男_,张家湾镇北仪阁村266号_,
    户主(男)_,张利_,110223198903183512_,男_,张家湾镇北仪阁村269号_,
    户主(男)_,徐连海,110223196209273535,男_,张家湾镇北仪阁村270号_,
    户主(男)_,李军,1102231988812283534_,男_,张家湾镇北仪阁村273号_,
    户主(女)_,张妍_,11022319860918352X_,女_,张家湾镇北仪阁村277号_,
    夫,王涛,130281198307202016,男_,张家湾镇北仪阁村277号_,
    之女,王紫暄,110112201312233522,女_,张家湾镇北仪阁村277号_,
    户主(男)_,张超,11022319881010351X_,男_,张家湾镇北仪阁村277号_,
    户主(男)_,吕竞松_,110223198904013531_,男_,张家湾镇北仪阁村278号_,
    户主(女)_,荣淑玉_,110223197404083520_,女_,张家湾镇北仪阁村279号_,
    户主(女)_,荣岩_,110223198710243566_,女_,张家湾镇北仪阁村281号_,
    女_,刘俊熙,11011220101105351X,男_,张家湾镇北仪阁村281号_,
    户主(男)_,张磊_,110223198412283519_,男_,张家湾镇北仪阁村284号_,
    户主(男)_,赵洪藻,110104194912241638,男_,张家湾镇北仪阁村288号_,
    户主(男)_,刘玉辉_,110106197704100052_,男_,张家湾镇北仪阁村289号_,
    女_,刘昕__,110112200506093527_,女_,张家湾镇北仪阁村289号_,
    户主(男)_,王跃波_,11022319810105003X_,男_,张家湾镇北仪阁村290号_,
    长子_,王浩学,110112201208293517,男_,张家湾镇北仪阁村290号_,
    次子,王浩然,110112201610283536,男_,张家湾镇北仪阁村290号_,
    户主(男)_,王德茂_,110223195312033519_,男_,张家湾镇北仪阁村290号_,
    户主(男)_,管洪志_,110223198807313516_,男_,张家湾镇北仪阁村291号_,
    户主(男)_,管洪伟_,110223198011093511_,男_,张家湾镇北仪阁村291号_,
    户主（女）,赵海娟,,女_,张家湾镇北仪阁村294号_,
    户主(女)_,赵丽娜_,110223198508303529_,女_,张家湾镇北仪阁村296号_,
    户主(男)_,赵冬坡_,110223198701173519_,男_,张家湾镇北仪阁村296号_,
    户主(女)_,李雪_,110223198512193529_,女_,张家湾镇北仪阁村299号_,
    女儿,彭妙睛,110112201203213549,女_,张家湾镇北仪阁村299号_,
    户主(女)_,李娇_,110223199003143528_,女_,张家湾镇北仪阁村299号_,
    户主(男)_,王文术_,110223194908123510_,男_,张家湾镇北仪阁村300号_,
    户主(男)_,王铁春_,110223197512013511_,男_,张家湾镇北仪阁村300号_,
    户主(女)_,李德芬_,110223195208083524_,女_,张家湾镇北仪阁村300号_,
    户主(女)_,王巧玉,110223199603073527_,女_,张家湾镇北仪阁村302号_,
    户主(男)_,刘鹤_,11022319930919351X_,男_,张家湾镇北仪阁村304号_,
    户主(男)_,王瑞年_,110223198401033514_,男_,张家湾镇北仪阁316号村_,
    之子, 王雨泽,110112201301023538,男_,张家湾镇北仪阁村316号_,
    户主（男）,王瑞峰,110223198112013517,男_,张家湾镇北仪阁村336号_,2014.11.4迁入
    之女,王_,110112200902060321,女_,张家湾镇北仪阁村336号_,蒙古族`


    var persons = data.split('\n');


    var i = (function() {
        var i = JJ_AUTO_TASK_2_index + 1;
        if (i >= persons.length)
            i = 0;
        return i;
    })();
    for (; i < persons.length; i++) {

        var person = persons[i];
        var info = person.split(',');

        var relation = info[0].replace(/_/g, '');
        relation = (function(r) {
            // 0 其他
            // 1 户主
            // 2 之妻
            // 3 之夫
            // 4 之父
            // 5 之母
            // 6 之子
            // 7 之女
            // 8 儿媳妇
            // 9 之孙女
            // 10 之孙
            // 11 之兄
            // 12 之妹
            // 13 之外孙
            // 14 之外孙女
            // 15 之岳母
            // 16 之岳父

            if (r.indexOf('户主') > -1) return 1
            if (r.indexOf('妻') > -1) return 2
            if (r.indexOf('外孙子') > -1) return 13
            if (r.indexOf('孙子') > -1) return 10
            if (r.indexOf('岳母') > -1) return 15
            if (r.indexOf('岳父') > -1) return 16
            if (r.indexOf('媳妇') > -1) return 8
            if (r.indexOf('媳') > -1) return 8
            if (r.indexOf('子') > -1) return 6
            if (r.indexOf('外孙女') > -1) return 14
            if (r.indexOf('孙女') > -1) return 9
            if (r.indexOf('女') > -1) return 7
            if (r.indexOf('母') > -1) return 5
            if (r.indexOf('父') > -1) return 4
            if (r.indexOf('妹') > -1) return 12
            if (r.indexOf('兄') > -1) return 11
            if (r.indexOf('夫') > -1) return 3

            return 0
        })(relation);

        var name = info[1].replace(/_/g, '');
        var idcard = info[2].replace(/_/g, '').toUpperCase();
        var sex = info[3].replace(/_/g, '');
        sex = sex == '男' ? 1 : 2;
        var birthday = formatBirthday(getBirthday(idcard))

        console.log(birthday)

        // var birthday = info[4].replace(/_/g, '').replace(/年/g, '-').replace(/月/g, '-').replace(/日/g, '');
        // birthday = (function() {
        //     var b = new Date(birthday);
        //     var y = b.getFullYear();
        //     var m = b.getMonth() + 1 + '';
        //     var d = b.getDate() + '';

        //     if (m.length == 1) m = '0' + m;
        //     if (d.length == 1) d = '0' + d;

        //     return `${y}-${m}-${d}`
        // })();
        var number = info[4].replace(/_/g, '').replace(/张家湾镇北仪阁村/g, '').replace(/号/g, '')
        number = number * 1 + '';

        // 记录上次检索的位置
        JJ_AUTO_TASK_2_index = i;

        // 匹配到
        if (number == num) {

            console.log(i, relation, name, idcard, sex, birthday, number)

            setValue({
                relation,
                name,
                idcard,
                sex,
                birthday,
                number
            });

            return;
        }

    }


    function getBirthday(a) {
        if (15 == a.length || 18 == a.length) {
            var left = a.length - 12;
            var right = a.length - 4;
            var b = a.slice(left, right);
            if (8 == b.length) {
                return b;
            } else return 0;
        } else return 1;
    }

    function formatBirthday(val) {
        var b = ''

        try {
            var y = val.substr(0, 4);
            var m = val.substr(4, 2);
            var d = val.substr(6, 2);
            b = y + '-' + m + '-' + d
        } catch (e) {
            console.log(e)
            console.log('val:' + val)
            b = ''
        }
        return b
    }


    function setValue(data) {

        // 姓名
        $("#texthousecount").val(data.name);

        // 性别  1男 2女
        $("#textmenSex").val(data.sex);

        // 民族  1汉族
        $("#textnation").val(1);

        // 就业情况  1本地就业
        $("#textempsituation").val(1);

        // 出生年月
        $("#d11").val(data.birthday);

        // 社会关系
        $("#textsocialrelat").val(data.relation);

        // 身份证
        $("#textIdCard").val(data.idcard);

        // 户口迁移情况
        // $("#texthousemove").val()

        // 户别  1农户 2非农
        $("#texthuType").val(2);
    }
}